bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
// #############################################################################
// #### Copyright ##############################################################
// #############################################################################

/*
 * Copyright 2024 BaSSeM
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

// #############################################################################
// #### Description ############################################################
// #############################################################################

// #############################################################################
// #### Control Include(s) #####################################################
// #############################################################################

#include "Platform.h"

// #############################################################################
// #### Control Macro(s) #######################################################
// #############################################################################

#ifndef DEBUG
    #define DEBUG
#endif

#ifdef DEBUG
    #undef DEBUG
#endif

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#ifdef STM32L496xx

// #############################################################################
// #### Include(s) #############################################################
// #############################################################################

    #include "../../UART_Internal.h"
    #include "UART_STM32L496VGT6P.h"

    #include "stm32l4xx.h"
    #include "stm32l4xx_hal_uart.h"

// #############################################################################
// #### Private Macro(s) #######################################################
// #############################################################################

    #define UART_STM32L496VGT6P_BUFFER_SIZE_RECEIVE 4

// #############################################################################
// #### Private Type(s) ########################################################
// #############################################################################

/**
 * @brief UART STM32L496VGT6P Operation
 *
 * @enum UART_STM32L496VGT6P_OperationType_t
 */
typedef enum UART_STM32L496VGT6P_OperationType
{
    UART_STM32L496VGT6P_OperationType_None = 0, ///< None
    UART_STM32L496VGT6P_OperationType_Pending,  ///< Pending
    UART_STM32L496VGT6P_OperationType_Commit,   ///< Commit
    UART_STM32L496VGT6P_OperationType_Transmit, ///< Transmit
    UART_STM32L496VGT6P_OperationType_Receive,  ///< Receive
} UART_STM32L496VGT6P_OperationType_t;

/**
 * @brief UART STM32L496VGT6P Operation Handler
 */
typedef UART_STM32L496VGT6P_Status_t ( *UART_STM32L496VGT6P_OperationHandler_t )( UART_STM32L496VGT6P_Instance_t * Instance );

/**
 * @brief UART STM32L496VGT6P Operation Context
 *
 * @struct UART_STM32L496VGT6P_OperationContext_t
 */
typedef struct UART_STM32L496VGT6P_OperationContext
{
    UART_STM32L496VGT6P_Data_t * DataTx;
    UART_STM32L496VGT6P_DataLength_t DataTxLength;

    UART_STM32L496VGT6P_Data_t * DataRx;
    UART_STM32L496VGT6P_DataLength_t DataRxLength;
} UART_STM32L496VGT6P_OperationContext_t;

/**
 * @brief UART STM32L496VGT6P Operation
 *
 * @struct UART_STM32L496VGT6P_Operation_t
 */
typedef struct UART_STM32L496VGT6P_Operation
{
    UART_STM32L496VGT6P_OperationType_t Type;       ///< Type
    UART_STM32L496VGT6P_OperationHandler_t Handler; ///< Handler
    UART_STM32L496VGT6P_Status_t Status;            ///< Status
    TIM_Timestamp_t Timeout;                        ///< Timeout
    UART_STM32L496VGT6P_OperationContext_t Context; ///< Context
} UART_STM32L496VGT6P_Operation_t;

/**
 * @brief UART STM32L496VGT6P Process Type
 *
 * @enum UART_STM32L496VGT6P_ProcessType_t
 */
typedef enum UART_STM32L496VGT6P_ProcessType
{
    UART_STM32L496VGT6P_ProcessType_None = 0,   ///< None
    UART_STM32L496VGT6P_ProcessType_Initialize, ///< Initialize
    UART_STM32L496VGT6P_ProcessType_Transmit,   ///< Transmit
} UART_STM32L496VGT6P_ProcessType_t;

/**
 * @brief UART STM32L496VGT6P Process Handler
 */
typedef UART_STM32L496VGT6P_Status_t ( *UART_STM32L496VGT6P_ProcessHandler_t )( UART_STM32L496VGT6P_Instance_t * Instance );

/**
 * @brief UART STM32L496VGT6P Process Context
 *
 * @struct UART_STM32L496VGT6P_ProcessContext_t
 */
typedef struct UART_STM32L496VGT6P_ProcessContext
{
    UART_STM32L496VGT6P_Operation_t Operation; ///< Operation
} UART_STM32L496VGT6P_ProcessContext_t;

/**
 * @brief UART STM32L496VGT6P Process
 *
 * @struct UART_STM32L496VGT6P_Process_t
 */
typedef struct UART_STM32L496VGT6P_Process
{
    UART_STM32L496VGT6P_ProcessType_t Type;       ///< Type
    UART_STM32L496VGT6P_ProcessHandler_t Handler; ///< Handler
    UART_STM32L496VGT6P_ProcessContext_t Context; ///< Context
} UART_STM32L496VGT6P_Process_t;

typedef struct UART_STM32L496VGT6P_BufferReceive
{
    volatile uint32_t Length;
    uint8_t Content[ UART_STM32L496VGT6P_BUFFER_SIZE_RECEIVE ];
} UART_STM32L496VGT6P_BufferReceive_t;

typedef enum UART_STM32L496VGT6P_Event
{
    UART_STM32L496VGT6P_Event_None = 0,
    UART_STM32L496VGT6P_Event_Interrupt = UTIL_BIT( 0 ),
    UART_STM32L496VGT6P_Event_TxComplete = UTIL_BIT( 1 ),
    UART_STM32L496VGT6P_Event_RxComplete = UTIL_BIT( 2 ),
    UART_STM32L496VGT6P_Event_AbortTxComplete = UTIL_BIT( 3 ),
    UART_STM32L496VGT6P_Event_AbortRxComplete = UTIL_BIT( 4 ),
    UART_STM32L496VGT6P_Event_AbortComplete = UTIL_BIT( 5 ),
    UART_STM32L496VGT6P_Event_ErrorParity = UTIL_BIT( 6 ),
    UART_STM32L496VGT6P_Event_ErrorNoise = UTIL_BIT( 7 ),
    UART_STM32L496VGT6P_Event_ErrorFrame = UTIL_BIT( 8 ),
    UART_STM32L496VGT6P_Event_ErrorOverrun = UTIL_BIT( 9 ),
    UART_STM32L496VGT6P_Event_ErrorDMA = UTIL_BIT( 10 ),
    UART_STM32L496VGT6P_Event_ErrorReceiverTimeout = UTIL_BIT( 11 ),
    UART_STM32L496VGT6P_Event_RxEvent = UTIL_BIT( 12 ),
    UART_STM32L496VGT6P_Event_RxError = UTIL_BIT( 13 ),
    UART_STM32L496VGT6P_Event_Wakeup = UTIL_BIT( 14 ),
    UART_STM32L496VGT6P_Event_RxFull = UTIL_BIT( 15 ),
    UART_STM32L496VGT6P_Event_TxEmpty = UTIL_BIT( 16 ),
} UART_STM32L496VGT6P_Event_t;

