bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
typedef struct UART_STM32L496VGT6P_Instance_Context
{
    UART_HandleTypeDef UARTx;

    UART_STM32L496VGT6P_BufferReceive_t Receive;

    UART_STM32L496VGT6P_Event_t Event;

    UART_STM32L496VGT6P_Process_t Process;
} UART_STM32L496VGT6P_Instance_Context_t;

typedef struct UART_STM32L496VGT6P_Context
{
    TIM_Timestamp_t Timestamp;
    UART_STM32L496VGT6P_Instance_Context_t Context[ UART_STM32L496VGT6P_Count ];
} UART_STM32L496VGT6P_Context_t;

// #############################################################################
// #### Private Method(s) Prototype ############################################
// #############################################################################

void USART1_IRQHandler( void );
void USART2_IRQHandler( void );
void USART3_IRQHandler( void );
void UART4_IRQHandler( void );
void UART5_IRQHandler( void );
void LPUART1_IRQHandler( void );

void HAL_UART_TxCpltCallback( UART_HandleTypeDef * huart );
void HAL_UART_TxHalfCpltCallback( UART_HandleTypeDef * huart );
void HAL_UART_RxCpltCallback( UART_HandleTypeDef * huart );
void HAL_UART_RxHalfCpltCallback( UART_HandleTypeDef * huart );
void HAL_UART_ErrorCallback( UART_HandleTypeDef * huart );
void HAL_UART_AbortCpltCallback( UART_HandleTypeDef * huart );
void HAL_UART_AbortTransmitCpltCallback( UART_HandleTypeDef * huart );
void HAL_UART_AbortReceiveCpltCallback( UART_HandleTypeDef * huart );
void HAL_UARTEx_RxEventCallback( UART_HandleTypeDef * huart, uint16_t Size );
void HAL_UARTEx_WakeupCallback( UART_HandleTypeDef * huart );
void HAL_UARTEx_RxFifoFullCallback( UART_HandleTypeDef * huart );
void HAL_UARTEx_TxFifoEmptyCallback( UART_HandleTypeDef * huart );

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Context_Initialize( void );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Context_Cycle( void );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Context_DeInitialize( void );

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Instance_Initialize( UART_STM32L496VGT6P_Instance_t * Instance );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Instance_Cycle( UART_STM32L496VGT6P_Instance_t * Instance );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Instance_DeInitialize( UART_STM32L496VGT6P_Instance_t * Instance );

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_SetProcess( UART_STM32L496VGT6P_Instance_t * Instance, UART_STM32L496VGT6P_ProcessType_t ProcessType );

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_ProcessInitialize( UART_STM32L496VGT6P_Instance_t * Instance );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_ProcessTransmit( UART_STM32L496VGT6P_Instance_t * Instance );

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationCommitExecute( UART_STM32L496VGT6P_Instance_t * Instance );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationCommitResolve( UART_STM32L496VGT6P_Instance_t * Instance );

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationTransmitExecute( UART_STM32L496VGT6P_Instance_t * Instance );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationTransmitResolve( UART_STM32L496VGT6P_Instance_t * Instance );

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationReceiveExecute( UART_STM32L496VGT6P_Instance_t * Instance );
static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationReceiveResolve( UART_STM32L496VGT6P_Instance_t * Instance );

// #############################################################################
// #### Private Variable(s) ####################################################
// #############################################################################

static UART_STM32L496VGT6P_Context_t UART_STM32L496VGT6P_Context;

// #############################################################################
// #### Private Method(s) ######################################################
// #############################################################################

void USART1_IRQHandler( void )
{
    UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_1 ];

    Context->Event |= UART_STM32L496VGT6P_Event_Interrupt;

    HAL_UART_IRQHandler( &Context->UARTx );
}

void USART2_IRQHandler( void )
{
    UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_2 ];

    Context->Event |= UART_STM32L496VGT6P_Event_Interrupt;

    HAL_UART_IRQHandler( &Context->UARTx );
}

void USART3_IRQHandler( void )
{
    UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_3 ];

    Context->Event |= UART_STM32L496VGT6P_Event_Interrupt;

    HAL_UART_IRQHandler( &Context->UARTx );
}

void UART4_IRQHandler( void )
{
    UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_4 ];

    Context->Event |= UART_STM32L496VGT6P_Event_Interrupt;

    HAL_UART_IRQHandler( &Context->UARTx );
}

void UART5_IRQHandler( void )
{
    UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_5 ];

    Context->Event |= UART_STM32L496VGT6P_Event_Interrupt;

    HAL_UART_IRQHandler( &Context->UARTx );
}

void LPUART1_IRQHandler( void )
{
    UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_6 ];

    Context->Event |= UART_STM32L496VGT6P_Event_Interrupt;

    HAL_UART_IRQHandler( &Context->UARTx );
}

void HAL_UART_TxCpltCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_TxComplete;
            break;
        }
    }
}

void HAL_UART_TxHalfCpltCallback( UART_HandleTypeDef * huart )
{
}

void HAL_UART_RxCpltCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_RxComplete;

            Context->Receive.Length += huart->RxXferSize;
            if ( Context->Receive.Length >= UTIL_SizeOf( Context->Receive.Content ) )
            {
                Context->Event |= UART_STM32L496VGT6P_Event_RxFull;
                Context->Receive.Length = UTIL_SizeOf( Context->Receive.Content );
            }

