bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
            HAL_StatusTypeDef HAL_Status = HAL_ERROR;
            if ( ( HAL_Status = HAL_UARTEx_ReceiveToIdle_IT( &Context->UARTx, Context->Receive.Content + Context->Receive.Length, UTIL_SizeOf( Context->Receive.Content ) - Context->Receive.Length ) ) != HAL_OK )
            {
                // FIXME
                // Status = UART_STM32L496VGT6P_Status_Error;
                // break;
            }
        }
    }
}

void HAL_UART_RxHalfCpltCallback( UART_HandleTypeDef * huart )
{
}

void HAL_UART_ErrorCallback( UART_HandleTypeDef * huart )
{
    uint32_t error = HAL_UART_GetError( huart );

    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            if ( ( error & HAL_UART_ERROR_PE ) == HAL_UART_ERROR_PE )
            {
                Context->Event |= UART_STM32L496VGT6P_Event_ErrorParity;
            }
            if ( ( error & HAL_UART_ERROR_NE ) == HAL_UART_ERROR_NE )
            {
                Context->Event |= UART_STM32L496VGT6P_Event_ErrorNoise;
            }
            if ( ( error & HAL_UART_ERROR_FE ) == HAL_UART_ERROR_FE )
            {
                Context->Event |= UART_STM32L496VGT6P_Event_ErrorFrame;
            }
            if ( ( error & HAL_UART_ERROR_ORE ) == HAL_UART_ERROR_ORE )
            {
                Context->Event |= UART_STM32L496VGT6P_Event_ErrorOverrun;
            }
            if ( ( error & HAL_UART_ERROR_DMA ) == HAL_UART_ERROR_DMA )
            {
                Context->Event |= UART_STM32L496VGT6P_Event_ErrorDMA;
            }
            if ( ( error & HAL_UART_ERROR_RTO ) == HAL_UART_ERROR_RTO )
            {
                Context->Event |= UART_STM32L496VGT6P_Event_ErrorReceiverTimeout;
            }
            break;
        }
    }
}

void HAL_UART_AbortCpltCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_AbortComplete;
            break;
        }
    }
}

void HAL_UART_AbortTransmitCpltCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_AbortTxComplete;
            break;
        }
    }
}

void HAL_UART_AbortReceiveCpltCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_AbortRxComplete;
            break;
        }
    }
}

void HAL_UARTEx_RxEventCallback( UART_HandleTypeDef * huart, uint16_t Size )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_RxEvent;
            break;
        }
    }
}

void HAL_UARTEx_WakeupCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_Wakeup;
            break;
        }
    }
}

void HAL_UARTEx_RxFifoFullCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_RxFull;
            break;
        }
    }
}

void HAL_UARTEx_TxFifoEmptyCallback( UART_HandleTypeDef * huart )
{
    for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
    {
        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

        if ( &Context->UARTx == huart )
        {
            Context->Event |= UART_STM32L496VGT6P_Event_TxEmpty;
            break;
        }
    }
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Context_Initialize( void )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Error;
    do
    {
        UART_Trace( "%s( void )", __FUNCTION__ );

        // FIXME Remove the usage of `MX_USARTx_UART_Init()`
    #if 1
        extern UART_HandleTypeDef huart1;
        extern DMA_HandleTypeDef hdma_usart1_tx;
        extern DMA_HandleTypeDef hdma_usart1_rx;
        extern void MX_USART1_UART_Init( void );
        MX_USART1_UART_Init( );
        UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_1 ].UARTx = huart1;
        __HAL_LINKDMA( &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_1 ].UARTx, hdmatx, hdma_usart1_tx );
        __HAL_LINKDMA( &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_1 ].UARTx, hdmarx, hdma_usart1_rx );

        extern UART_HandleTypeDef huart2;
        extern DMA_HandleTypeDef hdma_usart2_tx;
        extern DMA_HandleTypeDef hdma_usart2_rx;
        extern void MX_USART2_UART_Init( void );
        MX_USART2_UART_Init( );
        UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_2 ].UARTx = huart2;
        __HAL_LINKDMA( &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_2 ].UARTx, hdmatx, hdma_usart2_tx );
        __HAL_LINKDMA( &UART_STM32L496VGT6P_Context.Context[ UART_STM32L496VGT6P_2 ].UARTx, hdmarx, hdma_usart2_rx );
    #endif

        for ( UART_STM32L496VGT6P_t UART_x = UART_STM32L496VGT6P_1; UART_x < UART_STM32L496VGT6P_Count; ++UART_x )
        {
            UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ UART_x ];

