bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
            HAL_StatusTypeDef HAL_Status = HAL_ERROR;
            if ( ( HAL_Status = HAL_UART_Receive_IT( &Context->UARTx, ( uint8_t * ) Context->Receive.Content, 1 ) ) != HAL_OK )
            {
                Status = UART_STM32L496VGT6P_Status_Error;
                break;
            }
        }

        Status = UART_STM32L496VGT6P_Status_Success;
    }
    while ( 0 );
    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Context_Cycle( void )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Error;

    do
    {
        UART_Trace( "%s( void )", __FUNCTION__ );

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_GetTimestamp( UART_TIM, &UART_STM32L496VGT6P_Context.Timestamp ) ) != TIM_Status_Success )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        Status = UART_STM32L496VGT6P_Status_Success;
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Context_DeInitialize( void )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Error;

    do
    {
        UART_Trace( "%s( void )", __FUNCTION__ );

        Status = UART_STM32L496VGT6P_Status_Success;
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Instance_Initialize( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];

        // TODO GPIOs Configurations

        Context->Receive.Length = 0;
        Context->Receive.Content[ Context->Receive.Length ] = 0;

        Context->Event = UART_STM32L496VGT6P_Event_None;

        Instance->Context = Context;

        Status = UART_STM32L496VGT6P_SetProcess( Instance, UART_STM32L496VGT6P_ProcessType_Initialize );
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Instance_Cycle( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Error;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        Status = UART_STM32L496VGT6P_Status_Success;

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;
        UART_STM32L496VGT6P_Event_t Event = Context->Event; // CAUTION: Has to copy events occurred at the early start of the cycle, so as to be cleared at the end of the cycle,
                                                            //          which let events occurs after that for the next cycle call

        if ( Operation->Handler != NULL )
        {
            UART_STM32L496VGT6P_Status_t STM32L496VGT6P_Status = UART_STM32L496VGT6P_Status_Error;
            if ( ( STM32L496VGT6P_Status = Operation->Handler( Instance ) ) != UART_STM32L496VGT6P_Status_Success )
            {
                Status = STM32L496VGT6P_Status;
                // FIXME Operation reported non success status, is there any action ?
            }
        }

        if ( Process->Handler != NULL )
        {
            UART_STM32L496VGT6P_Status_t STM32L496VGT6P_Status = UART_STM32L496VGT6P_Status_Error;
            if ( ( STM32L496VGT6P_Status = Process->Handler( Instance ) ) != UART_STM32L496VGT6P_Status_Success )
            {
                Status = STM32L496VGT6P_Status;
                // FIXME Process reported non success status, is there any action ?
            }
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_Interrupt ) == UART_STM32L496VGT6P_Event_Interrupt )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_Interrupt;
            UART_Trace( "Interrupt: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_TxComplete ) == UART_STM32L496VGT6P_Event_TxComplete )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_TxComplete;
            UART_Debug( "TX Complete: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_RxComplete ) == UART_STM32L496VGT6P_Event_RxComplete )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_RxComplete;
            UART_Debug( "RX Complete: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_AbortTxComplete ) == UART_STM32L496VGT6P_Event_AbortTxComplete )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_AbortTxComplete;
            UART_Debug( "Abort TX Complete: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_AbortRxComplete ) == UART_STM32L496VGT6P_Event_AbortRxComplete )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_AbortRxComplete;
            UART_Debug( "Abort RX Complete: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_AbortComplete ) == UART_STM32L496VGT6P_Event_AbortComplete )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_AbortComplete;
            UART_Debug( "Abort Complete: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_ErrorParity ) == UART_STM32L496VGT6P_Event_ErrorParity )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_ErrorParity;
            UART_Debug( "Parity Error: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

