bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
        if ( ( Event & UART_STM32L496VGT6P_Event_ErrorNoise ) == UART_STM32L496VGT6P_Event_ErrorNoise )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_ErrorNoise;
            UART_Debug( "Noise Error: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_ErrorFrame ) == UART_STM32L496VGT6P_Event_ErrorFrame )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_ErrorFrame;
            UART_Debug( "Frame Error: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_ErrorOverrun ) == UART_STM32L496VGT6P_Event_ErrorOverrun )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_ErrorOverrun;
            UART_Debug( "Overrun Error: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_ErrorDMA ) == UART_STM32L496VGT6P_Event_ErrorDMA )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_ErrorDMA;
            UART_Debug( "DMA Error: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_ErrorReceiverTimeout ) == UART_STM32L496VGT6P_Event_ErrorReceiverTimeout )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_ErrorReceiverTimeout;
            UART_Debug( "Receiver Timeout: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_RxEvent ) == UART_STM32L496VGT6P_Event_RxEvent )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_RxEvent;
            UART_Debug( "RX Event: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        if ( ( Event & UART_STM32L496VGT6P_Event_Wakeup ) == UART_STM32L496VGT6P_Event_Wakeup )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_Wakeup;
            UART_Debug( "Wake-up: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }

        // FIXME Should it be removed ?
        if ( ( Event & UART_STM32L496VGT6P_Event_RxError ) == UART_STM32L496VGT6P_Event_RxError )
        {
            Context->Event &= ~UART_STM32L496VGT6P_Event_RxError;
            UART_Debug( "RX Error: Instance=%p, UARTx=%d", Instance, Instance->UARTx );
            // TODO Invoke Callback
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Instance_DeInitialize( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Error;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        Status = UART_STM32L496VGT6P_Status_Success;
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_SetProcess( UART_STM32L496VGT6P_Instance_t * Instance, UART_STM32L496VGT6P_ProcessType_t ProcessType )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p, ProcessType=%d )", __FUNCTION__, Instance, ProcessType );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        switch ( ProcessType )
        {
            case UART_STM32L496VGT6P_ProcessType_None:
                Process->Handler = NULL;
                break;

            case UART_STM32L496VGT6P_ProcessType_Initialize:
                Process->Handler = UART_STM32L496VGT6P_ProcessInitialize;
                break;

            case UART_STM32L496VGT6P_ProcessType_Transmit:
                Process->Handler = UART_STM32L496VGT6P_ProcessTransmit;
                break;

            default:
                UART_Warning( "%s Not Handled Type %d", __FUNCTION__, ProcessType );
                Status = UART_STM32L496VGT6P_Status_NotSupported;
                break;
        }
        if ( Status != UART_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        Process->Type = ProcessType;

        Operation->Handler = NULL;
        Operation->Status = UART_STM32L496VGT6P_Status_Success;
        Operation->Timeout = UART_STM32L496VGT6P_Context.Timestamp;

        switch ( ProcessType )
        {
            case UART_STM32L496VGT6P_ProcessType_None:
                Operation->Type = UART_STM32L496VGT6P_OperationType_None;
                break;

            default:
                Operation->Type = UART_STM32L496VGT6P_OperationType_Pending;
                break;
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_ProcessInitialize( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != UART_STM32L496VGT6P_ProcessType_Initialize )
        {
            UART_Error( "%s Got %d Expected %d", __FUNCTION__, Process->Type, UART_STM32L496VGT6P_ProcessType_Initialize );
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Operation->Handler != NULL )
        {
            // Operation In-progress
            break;
        }

        if ( Operation->Status != UART_STM32L496VGT6P_Status_Success )
        {
            Operation->Type = UART_STM32L496VGT6P_OperationType_None;
        }

        switch ( Operation->Type )
        {
            case UART_STM32L496VGT6P_OperationType_Pending:
                Operation->Status = UART_STM32L496VGT6P_OperationCommitExecute( Instance );
                break;

            case UART_STM32L496VGT6P_OperationType_Commit:
            default:
                if ( Instance->OnComplete != NULL )
                {
                    Instance->OnComplete( Instance, Operation->Status );
                }
                Status = UART_STM32L496VGT6P_SetProcess( Instance, UART_STM32L496VGT6P_ProcessType_None );
                break;
        }
    }
    while ( 0 );

