bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_ProcessTransmit( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != UART_STM32L496VGT6P_ProcessType_Transmit )
        {
            UART_Error( "%s Got %d Expected %d", __FUNCTION__, Process->Type, UART_STM32L496VGT6P_ProcessType_Transmit );
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Operation->Handler != NULL )
        {
            // Operation In-progress
            break;
        }

        if ( Operation->Status != UART_STM32L496VGT6P_Status_Success )
        {
            Operation->Type = UART_STM32L496VGT6P_OperationType_None;
        }

        switch ( Operation->Type )
        {
            case UART_STM32L496VGT6P_OperationType_Pending:
                Operation->Status = UART_STM32L496VGT6P_OperationTransmitExecute( Instance );
                break;

            case UART_STM32L496VGT6P_OperationType_Transmit:
            default:
                if ( Instance->OnComplete != NULL )
                {
                    Instance->OnComplete( Instance, Operation->Status );
                }
                Status = UART_STM32L496VGT6P_SetProcess( Instance, UART_STM32L496VGT6P_ProcessType_None );
                break;
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationCommitExecute( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

    // FIXME Keep CubeMX generated configurations as is for now
    #if 0
      HAL_StatusTypeDef HAL_Status = HAL_ERROR;
      if ( ( HAL_Status = HAL_UART_Init( &Instance->Context->UARTx ) ) != HAL_OK )
      {
        Status = UART_STM32L496VGT6P_Status_Error;
        break;
      }
    #endif

        Operation->Type = UART_STM32L496VGT6P_OperationType_Commit;
        Operation->Handler = UART_STM32L496VGT6P_OperationCommitResolve;
        Operation->Status = UART_STM32L496VGT6P_Status_Success;
        Operation->Timeout = UART_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 0 ) ) != TIM_Status_Success )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationCommitResolve( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != UART_STM32L496VGT6P_OperationType_Commit )
        {
            UART_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, UART_STM32L496VGT6P_OperationType_Commit );
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( UART_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = UART_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationTransmitExecute( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        HAL_StatusTypeDef HAL_Status = HAL_ERROR;
        if ( ( HAL_Status = HAL_UART_Transmit_DMA( &Instance->Context->UARTx, Operation->Context.DataTx, Operation->Context.DataTxLength ) ) != HAL_OK )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        Operation->Type = UART_STM32L496VGT6P_OperationType_Transmit;
        Operation->Handler = UART_STM32L496VGT6P_OperationTransmitResolve;
        Operation->Status = UART_STM32L496VGT6P_Status_Success;
        Operation->Timeout = UART_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 1000 ) ) != TIM_Status_Success )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationTransmitResolve( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != UART_STM32L496VGT6P_OperationType_Transmit )
        {
            UART_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, UART_STM32L496VGT6P_OperationType_Transmit );
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( UART_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = UART_STM32L496VGT6P_Status_Timeout;
            Operation->Handler = NULL;
            break;
        }

