bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
        if ( ( Context->Event & UART_STM32L496VGT6P_Event_TxComplete ) != 0 )
        {
            Operation->Status = UART_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationReceiveExecute( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        HAL_StatusTypeDef HAL_Status = HAL_ERROR;
        if ( ( HAL_Status = HAL_UART_Receive_DMA( &Instance->Context->UARTx, Operation->Context.DataRx, Operation->Context.DataRxLength ) ) != HAL_OK )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        Operation->Type = UART_STM32L496VGT6P_OperationType_Receive;
        Operation->Handler = UART_STM32L496VGT6P_OperationReceiveResolve;
        Operation->Status = UART_STM32L496VGT6P_Status_Success;
        Operation->Timeout = UART_STM32L496VGT6P_Context.Timestamp;

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_Timestamp_AddMillisecond( &Operation->Timeout, 1000 ) ) != TIM_Status_Success )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }
    }
    while ( 0 );

    return Status;
}

static UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_OperationReceiveResolve( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Operation->Type != UART_STM32L496VGT6P_OperationType_Receive )
        {
            UART_Error( "%s Got %d Expected %d", __FUNCTION__, Operation->Type, UART_STM32L496VGT6P_OperationType_Receive );
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        TIM_Status_t TIM_Status = TIM_Status_Error;
        if ( ( TIM_Status = TIM_IsExpiredTimestamp( UART_TIM, &Operation->Timeout ) ) == TIM_Status_Success )
        {
            Operation->Status = UART_STM32L496VGT6P_Status_Timeout;
            Operation->Handler = NULL;
            break;
        }

        if ( ( Context->Event & UART_STM32L496VGT6P_Event_RxComplete ) != 0 )
        {
            Operation->Status = UART_STM32L496VGT6P_Status_Success;
            Operation->Handler = NULL;
        }
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Method(s) #######################################################
// #############################################################################

UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Initialize( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( ( Status = UART_STM32L496VGT6P_Context_Initialize( ) ) != UART_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = UART_STM32L496VGT6P_Instance_Initialize( Instance ) ) != UART_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Cycle( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;
    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( ( Status = UART_STM32L496VGT6P_Context_Cycle( ) ) != UART_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = UART_STM32L496VGT6P_Instance_Cycle( Instance ) ) != UART_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_DeInitialize( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( ( Status = UART_STM32L496VGT6P_Instance_DeInitialize( Instance ) ) != UART_STM32L496VGT6P_Status_Success )
        {
            break;
        }

        if ( ( Status = UART_STM32L496VGT6P_Context_DeInitialize( ) ) != UART_STM32L496VGT6P_Status_Success )
        {
            break;
        }
    }
    while ( 0 );

    return Status;
}

UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_IsReady( UART_STM32L496VGT6P_Instance_t * Instance )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

