bassem-mostafa/UART_STM32L496VGT6P/UART_STM32L496VGT6P.c
        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != UART_STM32L496VGT6P_ProcessType_None
             || Operation->Type != UART_STM32L496VGT6P_OperationType_None )
        {
            Status = UART_STM32L496VGT6P_Status_Busy;
            break;
        }
    }
    while ( 0 );

    return Status;
}

UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Write( UART_STM32L496VGT6P_Instance_t * Instance, UART_STM32L496VGT6P_Data_t * Data, UART_STM32L496VGT6P_DataLength_t DataLength )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p )", __FUNCTION__, Instance );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        UART_STM32L496VGT6P_Instance_Context_t * Context = &UART_STM32L496VGT6P_Context.Context[ Instance->UARTx ];
        UART_STM32L496VGT6P_Process_t * Process = &Context->Process;
        UART_STM32L496VGT6P_Operation_t * Operation = &Process->Context.Operation;

        if ( Process->Type != UART_STM32L496VGT6P_ProcessType_None
             || Operation->Type != UART_STM32L496VGT6P_OperationType_None )
        {
            Status = UART_STM32L496VGT6P_Status_Busy;
            break;
        }

        Status = UART_STM32L496VGT6P_SetProcess( Instance, UART_STM32L496VGT6P_ProcessType_Transmit );

        Operation->Context.DataTx = Data;
        Operation->Context.DataTxLength = DataLength;
    }
    while ( 0 );

    return Status;
}

UART_STM32L496VGT6P_Status_t UART_STM32L496VGT6P_Read( UART_STM32L496VGT6P_Instance_t * Instance, UART_STM32L496VGT6P_Data_t * Data, UART_STM32L496VGT6P_DataLength_t DataLength )
{
    UART_STM32L496VGT6P_Status_t Status = UART_STM32L496VGT6P_Status_Success;

    do
    {
        UART_Trace( "%s( Instance=%p, Data=%p, Length=%d )", __FUNCTION__, Instance, Data, DataLength );

        if ( Instance == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_ArgumentInvalid;
            break;
        }

        if ( Instance->Context == NULL )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        if ( Instance->Context->Receive.Length < DataLength )
        {
            Status = UART_STM32L496VGT6P_Status_Error;
            break;
        }

        UTIL_MemoryCopy( Data, Instance->Context->Receive.Content, DataLength );
        KERNEL_InterruptDisable( );
        UTIL_MemoryCopy( Instance->Context->Receive.Content, Instance->Context->Receive.Content + DataLength, Instance->Context->Receive.Length - DataLength );
        Instance->Context->Receive.Length -= DataLength;
        Instance->Context->Receive.Content[ Instance->Context->Receive.Length ] = 0;
        Instance->Context->UARTx.pRxBuffPtr -= DataLength;
        KERNEL_InterruptEnable( );
    }
    while ( 0 );

    return Status;
}

// #############################################################################
// #### Public Variable(s) #####################################################
// #############################################################################

const char UART_STM32L496VGT6P_VERSION[] = "0.0.0.v20260125-0138";

// #############################################################################
// #### File Guard #############################################################
// #############################################################################

#endif /* STM32L496xx */

// #############################################################################
// #### END OF FILE ############################################################
// #############################################################################
